FemDesign.ActivatedLoadCase.#ctor
Private construction for serialization

FemDesign.ActivatedLoadCase.#ctor(FemDesign.Loads.LoadCase,System.Double,FemDesign.ActivationType)
Create a (construction stage) activated load case.
loadCase: The load case to be activated.
factor: Load case factor.
type: Activation type.

FemDesign.ActivatedLoadCase.#ctor(FemDesign.PTCLoadCase,System.Double,FemDesign.ActivationType)
Create a (construction stage) activated load case of a PTC load case.
loadCase: The PTC load case to be activated.
factor: Load case factor.
type: Activation type.

FemDesign.ActivatedLoadCase.#ctor(StruSoft.Interop.StruXml.Data.Moving_load_type,System.Int32,System.Double,FemDesign.ActivationType)
Create a (construction stage) activated load case of a Moving load case.
movingLoad: The moving load to be activated.
index: The step/index of the moving load.
factor: Load case factor.
type: Activation type.